import img1 from "./dataImg/book1.png";
import img2 from "./dataImg/book2.png";

export const books = [
  {
    id: 1,
    name: "1984",
    author: "Джордж Оруэлл",
    title:
      "Бош қаҳрамон Уинстон Смит — ташқи партиянинг вакили. У Лондонда истиқомат қилиб, Ҳақиқат вазирлигида иш юритади. Партиянинг мафкура ва ғояларига нисбатан гумонларини ҳеч кимга ошкор этмасликка ҳаракат қилса ҳам, кундалик дафтар сотиб олиб ўз фикрларини ёзиб боради.",
    pages: 450,
    img: img2,
  },
  {
    id: 2,
    name: "Бешинчи категория",
    author: "Исҳоқ Масихов",
    title:
      "Фантастик ҳикоялар тўплами, унда асарлар турли жанрларни ўз ичига олган. Ҳар бир ҳикоя ўз дунёси ва қаҳрамонлари билан ажралиб туради.",
    pages: 320,
    img: img1,
  },
  {
    id: 3,
    name: "Мастер ва Маргарита",
    author: "Михаил Булгаков",
    title:
      "Классик асар, унда муҳаббат, сиёсат ва дин мавзулари жуда мураккаб тарзда бирлашган. Асарнинг марказий ҳикояси бўлган Москвадаги воқеаларга қўшимча сифатида, Исо пайғамбарнинг суд жараёни ҳам тасвирланган.",
    pages: 520,
    img: img2,
  },
  {
    id: 4,
    name: "Зулматнинг юраги",
    author: "Жозеф Конрад",
    title:
      "Колония вакиллари ва маҳаллий аҳоли ўртасидаги муносабатларни тадқиқ этувчи қоронғу ва сирли асар. Асар марказида Куртц исмли шубҳали ва чалкаш қаҳрамон туради.",
    pages: 250,
    img: img1,
  },
  {
    id: 5,
    name: "Альхимик",
    author: "Пауло Коэльо",
    title:
      "Философик роман, у инсоннинг ҳаётдаги йўлини топиш учун маънавий сафарини тасвирлайди. Қаҳрамоннинг орзуси ва ҳақиқий бахтни топиш учун сафар қилиши асосий мавзуларидан биридир.",
    pages: 300,
    img: img2,
  },
  {
    id: 6,
    name: "Улгуржиларнинг тарихи",
    author: "Стивен Кинг",
    title:
      "Стивен Кингнинг қўрқинчли асарлари орасида машҳур бўлган ҳикоялар тўплами. Ҳар бир ҳикоя қўрқинч ва тахликадан иборат.",
    pages: 380,
    img: img1,
  },
  {
    id: 7,
    name: "Хавфли ўйинлар",
    author: "Агата Кристи",
    title:
      "Детектив роман, унда сирли қотиллик ҳолатлари бўйича машҳур детектив Пуаро тадқиқот олиб боради. Жанрнинг классик намуналаридан бири.",
    pages: 340,
    img: img2,
  },
  {
    id: 8,
    name: "Қўрқувнинг номи",
    author: "Франк Герберт",
    title:
      "Илмий фантастика жанридаги машҳур асар, унда инсон табиати, технология ва сиёсат масалалари ўрганилади. Асар ўзининг чуқур фикрлари ва мураккаб мавзулари билан ажралиб туради.",
    pages: 540,
    img: img1,
  },
  {
    id: 9,
    name: "Шерлок Холмс",
    author: "Артур Конан Дойл",
    title:
      "Таниқли детектив қаҳрамон Шерлок Холмснинг серқирра ўйинлари ва қизиқарли қотиллик ҳолатларини тадқиқ қилишга бағишланган машҳур ҳикоялар тўплами.",
    pages: 450,
    img: img2,
  },
  {
    id: 10,
    name: "Анна Каренина",
    author: "Лев Толстой",
    title:
      "Роман, у ишқий, оилавий муносабатлар, жамиятнинг қадриятлари ва инсоннинг ички қарама-қаршиликлари мавзуларига бағишланган. Асар Россиянинг ўтган даврларини, ундаги сиёсий ва ижтимоий тузилишни кўрсатиб беради.",
    pages: 850,
    img: img1,
  },
];
